9) /Users/alabarentojr/Developer/Projects/Packages/jira-worklogs/src/Http/WorkLogApi.php:78    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getWorkLogs(?array $query = null) : array
     {
-        $response = $this->client->get(self::RESOURCE, ['headers' => ['AUTHORIZATION' => 'Bearer ' . $this->configuration->getToken()]]);
+        $response = $this->client->get(self::RESOURCE, []);
         return \json_decode($response->getBody()->getContents(), true);
     }
 }

10) /Users/alabarentojr/Developer/Projects/Packages/jira-worklogs/src/Http/WorkLogApi.php:79    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getWorkLogs(?array $query = null) : array
     {
-        $response = $this->client->get(self::RESOURCE, ['headers' => ['AUTHORIZATION' => 'Bearer ' . $this->configuration->getToken()]]);
+        $response = $this->client->get(self::RESOURCE, ['headers' => []]);
         return \json_decode($response->getBody()->getContents(), true);
     }
 }
